Revit 2024 API
FabricationPart.GetPartCustomDataText Method
 Get custom data text for the specified custom data.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017 Subscription Update
Syntax
C#
public string GetPartCustomDataText(
	int customId
)
Visual Basic
Public Function GetPartCustomDataText ( _
	customId As Integer _
) As String
Visual C++
public:
String^ GetPartCustomDataText(
	int customId
)
Parameters
customId
Type: System.Int32
 The identifier of the custom data field to get.
Return Value
 Returns the text of the custom data. If the data is a number it will be formatted according to the fabrication configuration's rules.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The custom data does not exist on the part.
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace